/*
Направете програма, в която дефинирайте макро - функция, която приема два аргумента (A и B) и да намира колко е
 резултата от (A + B) ^ 2. Демонстрирайте използването на това макро в main функцията. Изпълнете стъпката на 
 препроцесинг за тази програма и качете резултата от нея в отделен файл към заданието.
*/

#include <stdio.h>

#define STEPEN(A, B) ((A) + (B)) * ((A) + (B))

int main() {

    int a, b;
    scanf("%d", &a);
    scanf("%d", &b);
    float answer = STEPEN(a, b);
    printf("%f", answer);
    return 0;

}